Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_lptim16.h
#define LPTIM16_ISR_OVRIF_Pos (8U)
#define LPTIM16_ISR_OVRIF_Msk (0x3U << LPTIM16_ISR_OVRIF_Pos)
#define LPTIM16_ISR_OVRIF LPTIM16_ISR_OVRIF_Msk

#define LPTIM16_ISR_QDCIF_Pos (5U)
#define LPTIM16_ISR_QDCIF_Msk (0x1U << LPTIM16_ISR_QDCIF_Pos)
#define LPTIM16_ISR_QDCIF LPTIM16_ISR_QDCIF_Msk

#define LPTIM16_CCSR_CAPCFG_Pos (8U)
#define LPTIM16_CCSR_CAPCFG_Msk (0x3U << LPTIM16_CCSR_CAPCFG_Pos)
#define LPTIM16_CCSR_CAPCFG LPTIM16_CCSR_CAPCFG_Msk

#define LPTIM16_CCSR_CCP_Pos (16U)
#define LPTIM16_CCSR_CCP_Msk (0x1U << LPTIM16_CCSR_CCP_Pos)
#define LPTIM16_CCSR_CCP LPTIM16_CCSR_CCP_Msk

#define LPTIM16_CCSR_CAP1PSC_Pos (26U)
#define LPTIM16_CCSR_CAP1PSC_Msk (0x3fU << LPTIM16_CCSR_CAP1PSC_Pos)
#define LPTIM16_CCSR_CAP1PSC LPTIM16_CCSR_CAP1PSC_Msk

#define LPTIM16_CCSR_CCS_Pos (0U)
#define LPTIM16_CCSR_CCS_Msk (0x3U << LPTIM16_CCSR_CCS_Pos)
#define LPTIM16_CCSR_CCS LPTIM16_CCSR_CCS_Msk

#define LPTIM16_CCSR_CAPEDGE_Pos (20U)
#define LPTIM16_CCSR_CAPEDGE_Msk (0x1U << LPTIM16_CCSR_CAPEDGE_Pos)
#define LPTIM16_CCSR_CAPEDGE LPTIM16_CCSR_CAPEDGE_Msk

#define LPTIM16_ISR_QDIR_Pos (13U)
#define LPTIM16_ISR_QDIR_Msk (0x1U << LPTIM16_ISR_QDIR_Pos)
#define LPTIM16_ISR_QDIR LPTIM16_ISR_QDIR_Msk

#define LPTIM16_CCSR_CAP1SSEL_Pos (24U)
#define LPTIM16_CCSR_CAP1SSEL_Msk (0x3U << LPTIM16_CCSR_CAP1SSEL_Pos)
#define LPTIM16_CCSR_CAP1SSEL LPTIM16_CCSR_CAP1SSEL_Msk

#define FL_LPTIM16_CHANNEL_1 (0x1U << 0U)
#define FL_LPTIM16_CHANNEL_2 (0x1U << 1U)

#define FL_LPTIM16_CLK_SOURCE_INTERNAL (0x0U << LPTIM16_CFGR_PSCSEL_Pos)
#define FL_LPTIM16_CLK_SOURCE_EXTERNAL (0x1U << LPTIM16_CFGR_PSCSEL_Pos)

#define FL_LPTIM16_PSC_DIV1 (0x0U << LPTIM16_CFGR_DIVSEL_Pos)
#define FL_LPTIM16_PSC_DIV2 (0x1U << LPTIM16_CFGR_DIVSEL_Pos)
#define FL_LPTIM16_PSC_DIV4 (0x2U << LPTIM16_CFGR_DIVSEL_Pos)
#define FL_LPTIM16_PSC_DIV8 (0x3U << LPTIM16_CFGR_DIVSEL_Pos)
#define FL_LPTIM16_PSC_DIV16 (0x4U << LPTIM16_CFGR_DIVSEL_Pos)
#define FL_LPTIM16_PSC_DIV32 (0x5U << LPTIM16_CFGR_DIVSEL_Pos)
#define FL_LPTIM16_PSC_DIV64 (0x6U << LPTIM16_CFGR_DIVSEL_Pos)
#define FL_LPTIM16_PSC_DIV128 (0x7U << LPTIM16_CFGR_DIVSEL_Pos)

#define FL_LPTIM16_ETR_COUNT_EDGE_RISING (0x0U << LPTIM16_CFGR_EDGESEL_Pos)
#define FL_LPTIM16_ETR_COUNT_EDGE_FALLING (0x1U << LPTIM16_CFGR_EDGESEL_Pos)

#define FL_LPTIM16_ETR_TRIGGER_EDGE_RISING (0x0U << LPTIM16_CFGR_TRIGCFG_Pos)
#define FL_LPTIM16_ETR_TRIGGER_EDGE_FALLING (0x1U << LPTIM16_CFGR_TRIGCFG_Pos)
#define FL_LPTIM16_ETR_TRIGGER_EDGE_BOTH (0x2U << LPTIM16_CFGR_TRIGCFG_Pos)

#define FL_LPTIM16_ENCODER_MODE_DISABLE (0x0U << LPTIM16_CFGR_QEMD_Pos)
#define FL_LPTIM16_ENCODER_MODE_TI1FP1_TI2FP2_CNT (0x1U << LPTIM16_CFGR_QEMD_Pos)
#define FL_LPTIM16_ENCODER_MODE_TI2FP2_TI1FP1_CNT (0x2U << LPTIM16_CFGR_QEMD_Pos)
#define FL_LPTIM16_ENCODER_MODE_TI2FP2_CNT_TI1FP1_CNT (0x3U << LPTIM16_CFGR_QEMD_Pos)

#define FL_LPTIM16_TRGO_ENABLE (0x1U << LPTIM16_CFGR_MMS_Pos)
#define FL_LPTIM16_TRGO_UPDATE (0x2U << LPTIM16_CFGR_MMS_Pos)
#define FL_LPTIM16_TRGO_OC1REF (0x3U << LPTIM16_CFGR_MMS_Pos)
#define FL_LPTIM16_TRGO_IC1 (0x4U << LPTIM16_CFGR_MMS_Pos)
#define FL_LPTIM16_TRGO_IC2 (0x5U << LPTIM16_CFGR_MMS_Pos)

#define FL_LPTIM16_ONE_PULSE_MODE_CONTINUOUS (0x0U << LPTIM16_CFGR_ONST_Pos)
#define FL_LPTIM16_ONE_PULSE_MODE_SINGLE (0x1U << LPTIM16_CFGR_ONST_Pos)

#define FL_LPTIM16_OPERATION_MODE_NORMAL (0x0U << LPTIM16_CFGR_TMODE_Pos)
#define FL_LPTIM16_OPERATION_MODE_EXTERNAL_TRIGGER_CNT (0x1U << LPTIM16_CFGR_TMODE_Pos)
#define FL_LPTIM16_OPERATION_MODE_EXTERNAL_ASYNC_PULSE_CNT (0x2U << LPTIM16_CFGR_TMODE_Pos)
#define FL_LPTIM16_OPERATION_MODE_TIMEOUT (0x3U << LPTIM16_CFGR_TMODE_Pos)

#define FL_LPTIM16_IC_EDGE_RISING (0x0U << LPTIM16_CCSR_CAPCFG_Pos)
#define FL_LPTIM16_IC_EDGE_FALLING (0x1U << LPTIM16_CCSR_CAPCFG_Pos)
#define FL_LPTIM16_IC_EDGE_BOTH (0x2U << LPTIM16_CCSR_CAPCFG_Pos)

#define FL_LPTIM16_OC_POLARITY_NORMAL (0x0U << LPTIM16_CCSR_CCP_Pos)
#define FL_LPTIM16_OC_POLARITY_INVERT (0x1U << LPTIM16_CCSR_CCP_Pos)

#define FL_LPTIM16_IC_POLARITY_NORMAL (0x0U << LPTIM16_CCSR_CCP_Pos)
#define FL_LPTIM16_IC_POLARITY_INVERT (0x1U << LPTIM16_CCSR_CCP_Pos)

#define FL_LPTIM16_CHANNEL_MODE_DISABLE (0x0U << LPTIM16_CCSR_CCS_Pos)
#define FL_LPTIM16_CHANNEL_MODE_INPUT (0x1U << LPTIM16_CCSR_CCS_Pos)
#define FL_LPTIM16_CHANNEL_MODE_OUTPUT (0x2U << LPTIM16_CCSR_CCS_Pos)

#define FL_LPTIM16_IC_CAPCTURED_EDGE_FALLING (0x0U << LPTIM16_CCSR_CAPEDGE_Pos)
#define FL_LPTIM16_IC_CAPCTURED_EDGE_RISING (0x1U << LPTIM16_CCSR_CAPEDGE_Pos)

#define FL_LPTIM16_ENCODER_DIR_CH1_BEFORE_CH2 (0x0U << LPTIM16_ISR_QDIR_Pos)
#define FL_LPTIM16_ENCODER_DIR_CH1_BEHIND_CH2 (0x1U << LPTIM16_ISR_QDIR_Pos)

#define FL_LPTIM16_IC1_CAPTURE_SOURCE_CHANNEL1 (0x0U << LPTIM16_CCSR_CAP1SSEL_Pos)
#define FL_LPTIM16_IC1_CAPTURE_SOURCE_XTLF (0x1U << LPTIM16_CCSR_CAP1SSEL_Pos)
#define FL_LPTIM16_IC1_CAPTURE_SOURCE_RCLP (0x2U << LPTIM16_CCSR_CAP1SSEL_Pos)

  /**
   * @}
   */
  /* Exported functions ---------------------------------------------------------------------------------*/
  /** @defgroup LPTIM16_FL_Exported_Functions LPTIM16 Exported Functions
   * @{
   */

  /**
   * @brief    Enable LPTIM16
   * @rmtoll   CR    EN    FL_LPTIM16_Enable
   * @param    LPTIM16x LPTIM16 instance
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_Enable(LPTIM16_Type *LPTIM16x)
  {
    SET_BIT(LPTIM16x->CR, LPTIM16_CR_EN_Msk);
  }

  /**
   * @brief    Disable LPTIM16
   * @rmtoll   CR    EN    FL_LPTIM16_Disable
   * @param    LPTIM16x LPTIM16 instance
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_Disable(LPTIM16_Type *LPTIM16x)
  {
    CLEAR_BIT(LPTIM16x->CR, LPTIM16_CR_EN_Msk);
  }

  /**
   * @brief    Get LPTIM16 Enable Status
   * @rmtoll   CR    EN    FL_LPTIM16_IsEnabled
   * @param    LPTIM16x LPTIM16 instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IsEnabled(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CR, LPTIM16_CR_EN_Msk) == LPTIM16_CR_EN_Msk);
  }

  /**
   * @brief    Enable External Input Analog Filter
   * @rmtoll   CFGR    ETR_AFEN    FL_LPTIM16_EnableETRFilter
   * @param    LPTIM16x LPTIM16 instance
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_EnableETRFilter(LPTIM16_Type *LPTIM16x)
  {
    SET_BIT(LPTIM16x->CFGR, LPTIM16_CFGR_ETR_AFEN_Msk);
  }

  /**
   * @brief    Disable External Input Analog Filter
   * @rmtoll   CFGR    ETR_AFEN    FL_LPTIM16_DisableETRFilter
   * @param    LPTIM16x LPTIM16 instance
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_DisableETRFilter(LPTIM16_Type *LPTIM16x)
  {
    CLEAR_BIT(LPTIM16x->CFGR, LPTIM16_CFGR_ETR_AFEN_Msk);
  }

  /**
   * @brief    Get External Input Analog Filter Enable Status
   * @rmtoll   CFGR    ETR_AFEN    FL_LPTIM16_IsEnabledETRFilter
   * @param    LPTIM16x LPTIM16 instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IsEnabledETRFilter(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CFGR, LPTIM16_CFGR_ETR_AFEN_Msk) == LPTIM16_CFGR_ETR_AFEN_Msk);
  }

  /**
   * @brief    Set Prescaler Input
   * @rmtoll   CFGR    PSCSEL    FL_LPTIM16_SetClockSource
   * @param    LPTIM16x LPTIM16 instance
   * @param    source This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CLK_SOURCE_INTERNAL
   *           @arg @ref FL_LPTIM16_CLK_SOURCE_EXTERNAL
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_SetClockSource(LPTIM16_Type *LPTIM16x, uint32_t source)
  {
    MODIFY_REG(LPTIM16x->CFGR, LPTIM16_CFGR_PSCSEL_Msk, source);
  }

  /**
   * @brief    Get Prescaler Input Setting
   * @rmtoll   CFGR    PSCSEL    FL_LPTIM16_GetClockSource
   * @param    LPTIM16x LPTIM16 instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_LPTIM16_CLK_SOURCE_INTERNAL
   *           @arg @ref FL_LPTIM16_CLK_SOURCE_EXTERNAL
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_GetClockSource(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CFGR, LPTIM16_CFGR_PSCSEL_Msk));
  }

  /**
   * @brief    Set Counter Clock Division
   * @rmtoll   CFGR    DIVSEL    FL_LPTIM16_SetPrescaler
   * @param    LPTIM16x LPTIM16 instance
   * @param    psc This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_PSC_DIV1
   *           @arg @ref FL_LPTIM16_PSC_DIV2
   *           @arg @ref FL_LPTIM16_PSC_DIV4
   *           @arg @ref FL_LPTIM16_PSC_DIV8
   *           @arg @ref FL_LPTIM16_PSC_DIV16
   *           @arg @ref FL_LPTIM16_PSC_DIV32
   *           @arg @ref FL_LPTIM16_PSC_DIV64
   *           @arg @ref FL_LPTIM16_PSC_DIV128
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_SetPrescaler(LPTIM16_Type *LPTIM16x, uint32_t psc)
  {
    MODIFY_REG(LPTIM16x->CFGR, LPTIM16_CFGR_DIVSEL_Msk, psc);
  }

  /**
   * @brief    Get Counter Clock Division Setting
   * @rmtoll   CFGR    DIVSEL    FL_LPTIM16_GetPrescaler
   * @param    LPTIM16x LPTIM16 instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_LPTIM16_PSC_DIV1
   *           @arg @ref FL_LPTIM16_PSC_DIV2
   *           @arg @ref FL_LPTIM16_PSC_DIV4
   *           @arg @ref FL_LPTIM16_PSC_DIV8
   *           @arg @ref FL_LPTIM16_PSC_DIV16
   *           @arg @ref FL_LPTIM16_PSC_DIV32
   *           @arg @ref FL_LPTIM16_PSC_DIV64
   *           @arg @ref FL_LPTIM16_PSC_DIV128
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_GetPrescaler(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CFGR, LPTIM16_CFGR_DIVSEL_Msk));
  }

  /**
   * @brief    Set ETR Count Edge
   * @rmtoll   CFGR    EDGESEL    FL_LPTIM16_SetETRCountEdge
   * @param    LPTIM16x LPTIM16 instance
   * @param    edge This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_ETR_COUNT_EDGE_RISING
   *           @arg @ref FL_LPTIM16_ETR_COUNT_EDGE_FALLING
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_SetETRCountEdge(LPTIM16_Type *LPTIM16x, uint32_t edge)
  {
    MODIFY_REG(LPTIM16x->CFGR, LPTIM16_CFGR_EDGESEL_Msk, edge);
  }

  /**
   * @brief    Get ETR Count Edge Setting
   * @rmtoll   CFGR    EDGESEL    FL_LPTIM16_GetETRCountEdge
   * @param    LPTIM16x LPTIM16 instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_LPTIM16_ETR_COUNT_EDGE_RISING
   *           @arg @ref FL_LPTIM16_ETR_COUNT_EDGE_FALLING
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_GetETRCountEdge(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CFGR, LPTIM16_CFGR_EDGESEL_Msk));
  }

  /**
   * @brief    Set ETR Trigger Edge
   * @rmtoll   CFGR    TRIGCFG    FL_LPTIM16_SetETRTriggerEdge
   * @param    LPTIM16x LPTIM16 instance
   * @param    edge This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_ETR_TRIGGER_EDGE_RISING
   *           @arg @ref FL_LPTIM16_ETR_TRIGGER_EDGE_FALLING
   *           @arg @ref FL_LPTIM16_ETR_TRIGGER_EDGE_BOTH
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_SetETRTriggerEdge(LPTIM16_Type *LPTIM16x, uint32_t edge)
  {
    MODIFY_REG(LPTIM16x->CFGR, LPTIM16_CFGR_TRIGCFG_Msk, edge);
  }

  /**
   * @brief    Get ETR Trigger Edge Setting
   * @rmtoll   CFGR    TRIGCFG    FL_LPTIM16_GetETRTriggerEdge
   * @param    LPTIM16x LPTIM16 instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_LPTIM16_ETR_TRIGGER_EDGE_RISING
   *           @arg @ref FL_LPTIM16_ETR_TRIGGER_EDGE_FALLING
   *           @arg @ref FL_LPTIM16_ETR_TRIGGER_EDGE_BOTH
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_GetETRTriggerEdge(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CFGR, LPTIM16_CFGR_TRIGCFG_Msk));
  }

  /**
   * @brief    Set Quad Encoder Mode
   * @rmtoll   CFGR    QEMD    FL_LPTIM16_SetEncoderMode
   * @param    LPTIM16x LPTIM16 instance
   * @param    mode This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_ENCODER_MODE_DISABLE
   *           @arg @ref FL_LPTIM16_ENCODER_MODE_TI1FP1_TI2FP2_CNT
   *           @arg @ref FL_LPTIM16_ENCODER_MODE_TI2FP2_TI1FP1_CNT
   *           @arg @ref FL_LPTIM16_ENCODER_MODE_TI2FP2_CNT_TI1FP1_CNT
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_SetEncoderMode(LPTIM16_Type *LPTIM16x, uint32_t mode)
  {
    MODIFY_REG(LPTIM16x->CFGR, LPTIM16_CFGR_QEMD_Msk, mode);
  }

  /**
   * @brief    Get Quad Encoder Mode Setting
   * @rmtoll   CFGR    QEMD    FL_LPTIM16_GetEncoderMode
   * @param    LPTIM16x LPTIM16 instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_LPTIM16_ENCODER_MODE_DISABLE
   *           @arg @ref FL_LPTIM16_ENCODER_MODE_TI1FP1_TI2FP2_CNT
   *           @arg @ref FL_LPTIM16_ENCODER_MODE_TI2FP2_TI1FP1_CNT
   *           @arg @ref FL_LPTIM16_ENCODER_MODE_TI2FP2_CNT_TI1FP1_CNT
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_GetEncoderMode(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CFGR, LPTIM16_CFGR_QEMD_Msk));
  }

  /**
   * @brief    Set Sync Trigger Signal Output Source
   * @rmtoll   CFGR    MMS    FL_LPTIM16_SetTriggerOutput
   * @param    LPTIM16x LPTIM16 instance
   * @param    triggerOutput This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_TRGO_ENABLE
   *           @arg @ref FL_LPTIM16_TRGO_UPDATE
   *           @arg @ref FL_LPTIM16_TRGO_OC1REF
   *           @arg @ref FL_LPTIM16_TRGO_IC1
   *           @arg @ref FL_LPTIM16_TRGO_IC2
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_SetTriggerOutput(LPTIM16_Type *LPTIM16x, uint32_t triggerOutput)
  {
    MODIFY_REG(LPTIM16x->CFGR, LPTIM16_CFGR_MMS_Msk, triggerOutput);
  }

  /**
   * @brief    Get Sync Trigger Signal Output Source Setting
   * @rmtoll   CFGR    MMS    FL_LPTIM16_GetTriggerOutput
   * @param    LPTIM16x LPTIM16 instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_LPTIM16_TRGO_ENABLE
   *           @arg @ref FL_LPTIM16_TRGO_UPDATE
   *           @arg @ref FL_LPTIM16_TRGO_OC1REF
   *           @arg @ref FL_LPTIM16_TRGO_IC1
   *           @arg @ref FL_LPTIM16_TRGO_IC2
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_GetTriggerOutput(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CFGR, LPTIM16_CFGR_MMS_Msk));
  }

  /**
   * @brief    Set One Pulse Mode
   * @rmtoll   CFGR    ONST    FL_LPTIM16_SetOnePulseMode
   * @param    LPTIM16x LPTIM16 instance
   * @param    mode This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_ONE_PULSE_MODE_CONTINUOUS
   *           @arg @ref FL_LPTIM16_ONE_PULSE_MODE_SINGLE
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_SetOnePulseMode(LPTIM16_Type *LPTIM16x, uint32_t mode)
  {
    MODIFY_REG(LPTIM16x->CFGR, LPTIM16_CFGR_ONST_Msk, mode);
  }

  /**
   * @brief    Get One Pulse Mode Setting
   * @rmtoll   CFGR    ONST    FL_LPTIM16_GetOnePulseMode
   * @param    LPTIM16x LPTIM16 instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_LPTIM16_ONE_PULSE_MODE_CONTINUOUS
   *           @arg @ref FL_LPTIM16_ONE_PULSE_MODE_SINGLE
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_GetOnePulseMode(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CFGR, LPTIM16_CFGR_ONST_Msk));
  }

  /**
   * @brief    Set Operation Mode
   * @rmtoll   CFGR    TMODE    FL_LPTIM16_SetOperationMode
   * @param    LPTIM16x LPTIM16 instance
   * @param    mode This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_OPERATION_MODE_NORMAL
   *           @arg @ref FL_LPTIM16_OPERATION_MODE_EXTERNAL_TRIGGER_CNT
   *           @arg @ref FL_LPTIM16_OPERATION_MODE_EXTERNAL_ASYNC_PULSE_CNT
   *           @arg @ref FL_LPTIM16_OPERATION_MODE_TIMEOUT
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_SetOperationMode(LPTIM16_Type *LPTIM16x, uint32_t mode)
  {
    MODIFY_REG(LPTIM16x->CFGR, LPTIM16_CFGR_TMODE_Msk, mode);
  }

  /**
   * @brief    Get Operation Mode Setting
   * @rmtoll   CFGR    TMODE    FL_LPTIM16_GetOperationMode
   * @param    LPTIM16x LPTIM16 instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_LPTIM16_OPERATION_MODE_NORMAL
   *           @arg @ref FL_LPTIM16_OPERATION_MODE_EXTERNAL_TRIGGER_CNT
   *           @arg @ref FL_LPTIM16_OPERATION_MODE_EXTERNAL_ASYNC_PULSE_CNT
   *           @arg @ref FL_LPTIM16_OPERATION_MODE_TIMEOUT
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_GetOperationMode(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CFGR, LPTIM16_CFGR_TMODE_Msk));
  }

  /**
   * @brief    Set Channel 1 Output Compare Value
   * @rmtoll   CCR1        FL_LPTIM16_WriteCompareCH1
   * @param    LPTIM16x LPTIM16 instance
   * @param    compareValue
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_WriteCompareCH1(LPTIM16_Type *LPTIM16x, uint32_t compareValue)
  {
    MODIFY_REG(LPTIM16x->CCR1, (0xffffU << 0U), (compareValue << 0U));
  }

  /**
   * @brief    Get Channel 1 Output Compare Value
   * @rmtoll   CCR1        FL_LPTIM16_ReadCompareCH1
   * @param    LPTIM16x LPTIM16 instance
   * @retval
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_ReadCompareCH1(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CCR1, (0xffffU << 0U)) >> 0U);
  }

  /**
   * @brief    Set Channel 2 Output Compare Value
   * @rmtoll   CCR2        FL_LPTIM16_WriteCompareCH2
   * @param    LPTIM16x LPTIM16 instance
   * @param    compareValue
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_WriteCompareCH2(LPTIM16_Type *LPTIM16x, uint32_t compareValue)
  {
    MODIFY_REG(LPTIM16x->CCR2, (0xffffU << 0U), (compareValue << 0U));
  }

  /**
   * @brief    Get Channel 2 Output Compare Value
   * @rmtoll   CCR2        FL_LPTIM16_ReadCompareCH2
   * @param    LPTIM16x LPTIM16 instance
   * @retval
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_ReadCompareCH2(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CCR2, (0xffffU << 0U)) >> 0U);
  }

  /**
   * @brief    Get Channel 1 Input Capture Value
   * @rmtoll   CCR1        FL_LPTIM16_ReadCaptureCH1
   * @param    LPTIM16x LPTIM16 instance
   * @retval
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_ReadCaptureCH1(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CCR1, (0xffffU << 0U)) >> 0U);
  }

  /**
   * @brief    Get Channel 2 Input Capture Value
   * @rmtoll   CCR2        FL_LPTIM16_ReadCaptureCH2
   * @param    LPTIM16x LPTIM16 instance
   * @retval
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_ReadCaptureCH2(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CCR2, (0xffffU << 0U)) >> 0U);
  }

  /**
   * @brief    Enable Channel Capture/Compare Interrupt
   * @rmtoll   IER    CCIE    FL_LPTIM16_EnableIT_CC
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_EnableIT_CC(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    SET_BIT(LPTIM16x->IER, ((channel & 0x3) << 0x0U));
  }

  /**
   * @brief    Enable Update Event Interrupt
   * @rmtoll   IER    OVIE    FL_LPTIM16_EnableIT_Update
   * @param    LPTIM16x LPTIM16 instance
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_EnableIT_Update(LPTIM16_Type *LPTIM16x)
  {
    SET_BIT(LPTIM16x->IER, LPTIM16_IER_OVIE_Msk);
  }

  /**
   * @brief    Enable External Trigger Interrupt
   * @rmtoll   IER    TRIGIE    FL_LPTIM16_EnableIT_Trigger
   * @param    LPTIM16x LPTIM16 instance
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_EnableIT_Trigger(LPTIM16_Type *LPTIM16x)
  {
    SET_BIT(LPTIM16x->IER, LPTIM16_IER_TRIGIE_Msk);
  }

  /**
   * @brief    Enable Channel Capture Overflow Interrupt
   * @rmtoll   IER    OVRIE    FL_LPTIM16_EnableIT_CCOverflow
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_EnableIT_CCOverflow(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    SET_BIT(LPTIM16x->IER, ((channel & 0x3) << 0x8U));
  }

  /**
   * @brief    Enable Quaderate Decoder Direction Changed Interrupt
   * @rmtoll   IER    QDCIE    FL_LPTIM16_EnableIT_EncoderChangeDir
   * @param    LPTIM16x LPTIM16 instance
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_EnableIT_EncoderChangeDir(LPTIM16_Type *LPTIM16x)
  {
    SET_BIT(LPTIM16x->IER, LPTIM16_IER_QDCIE_Msk);
  }

  /**
   * @brief    Disable Channel Capture/Compare Interrupt
   * @rmtoll   IER    CCIE    FL_LPTIM16_DisableIT_CC
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_DisableIT_CC(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    CLEAR_BIT(LPTIM16x->IER, ((channel & 0x3) << 0x0U));
  }

  /**
   * @brief    Disable Update Event Interrupt
   * @rmtoll   IER    OVIE    FL_LPTIM16_DisableIT_Update
   * @param    LPTIM16x LPTIM16 instance
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_DisableIT_Update(LPTIM16_Type *LPTIM16x)
  {
    CLEAR_BIT(LPTIM16x->IER, LPTIM16_IER_OVIE_Msk);
  }

  /**
   * @brief    Disable External Trigger Interrupt
   * @rmtoll   IER    TRIGIE    FL_LPTIM16_DisableIT_Trigger
   * @param    LPTIM16x LPTIM16 instance
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_DisableIT_Trigger(LPTIM16_Type *LPTIM16x)
  {
    CLEAR_BIT(LPTIM16x->IER, LPTIM16_IER_TRIGIE_Msk);
  }

  /**
   * @brief    Disable Channel Capture Overflow Interrupt
   * @rmtoll   IER    OVRIE    FL_LPTIM16_DisableIT_CCOverflow
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_DisableIT_CCOverflow(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    CLEAR_BIT(LPTIM16x->IER, ((channel & 0x3) << 0x8U));
  }

  /**
   * @brief    Disable Quaderate Decoder Direction Changed Interrupt
   * @rmtoll   IER    QDCIE    FL_LPTIM16_DisableIT_EncoderChangeDir
   * @param    LPTIM16x LPTIM16 instance
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_DisableIT_EncoderChangeDir(LPTIM16_Type *LPTIM16x)
  {
    CLEAR_BIT(LPTIM16x->IER, LPTIM16_IER_QDCIE_Msk);
  }

  /**
   * @brief    Get Channel Capture/Compare Interrupt Enable Status
   * @rmtoll   IER    CCIE    FL_LPTIM16_IsEnabledIT_CC
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IsEnabledIT_CC(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->IER, ((channel & 0x3) << 0x0U)) == ((channel & 0x3) << 0x0U));
  }

